tutorials/multiphase/compressibleTwoPhaseEulerFoam/laminar/bubbleColumn/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);

air
{
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }
}

water
{
    diameterModel constant;
    constantCoeffs
    {
        d               1e-4;
    }
}

drag
{
    air     SchillerNaumann;
    water   SchillerNaumann;
}

heatTransfer
{
    air     RanzMarshall;
    water   RanzMarshall;
}

dispersedPhase          both;

residualPhaseFraction   1e-3;
residualSlip            1e-2;

// Virtual-mass ceofficient
Cvm             0.5;

// Lift coefficient
Cl              0;

// Minimum allowable pressure
pMin            10000;



// ************************************************************************* //
